app/views/books/_index.html.erb

          <%= render "favorites/favorite-btn", book: book %></td>
        <td>コメント数: <%= book.book_comments.count %></td>
---
SELECT "books".* FROM "books"